Revit 2026 API

# SortingOrder Enumeration

---

Enumerated type representing the sorting order of a collection of objects.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SortingOrder
```
```vb
Public Enumeration SortingOrder
```
```cpp
public enum class SortingOrder
```
```fsharp
type SortingOrder
```

| Member name | Value | Description |
| --- | --- | --- |
| Ascending | 1 | Ascending sorting order |
| Descending | 2 | Descending sorting order |

#### Reference

Autodesk.Revit.DB Namespace